---
type: AdvancedGlazing
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 11
tags: [revit-api, class]
---

# AdvancedGlazing

`Autodesk.Revit.DB.Visual.AdvancedGlazing` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | GlazingBackfaceCulling | 2018 | `public static string GlazingBackfaceCulling { get ; }` |
| Property | GlazingF0 | 2018 | `public static string GlazingF0 { get ; }` |
| Property | GlazingTransmissionColor | 2018 | `public static string GlazingTransmissionColor { get ; }` |
| Property | GlazingTransmissionRoughness | 2018 | `public static string GlazingTransmissionRoughness { get ; }` |
| Property | SurfaceAlbedo | 2018 | `public static string SurfaceAlbedo { get ; }` |
| Property | SurfaceAnisotropy | 2018 | `public static string SurfaceAnisotropy { get ; }` |
| Property | SurfaceCutout | 2018 | `public static string SurfaceCutout { get ; }` |
| Property | SurfaceNdfType | 2018 | `public static string SurfaceNdfType { get ; }` |
| Property | SurfaceNormal | 2018 | `public static string SurfaceNormal { get ; }` |
| Property | SurfaceRotation | 2018 | `public static string SurfaceRotation { get ; }` |
| Property | SurfaceRoughness | 2018 | `public static string SurfaceRoughness { get ; }` |